###########################################################################
#
# Generated by : Version 8.1 Build 163 10/28/2008 SJ Web Edition
#
# Project      : MorphIC_HS_245_Sync_fifo
# Revision     : MorphIC_HS_245_Sync_fifo
#
# Date         : Mon Nov 02 10:11:12 GMT Standard Time 2009
#
###########################################################################
 
 
# WARNING: Expected ENABLE_CLOCK_LATENCY to be set to 'ON', but it is set to 'OFF'
#          In SDC, create_generated_clock auto-generates clock latency
#
# ------------------------------------------
#
# Create generated clocks based on PLLs
derive_pll_clocks -use_tan_name
#
# ------------------------------------------


# Original Clock Setting Name: clk2
create_clock -period "16.666 ns" \
             -name {mclk60} {mclk60}
# ---------------------------------------------


# Original Clock Setting Name: clk1
#create_clock -period "16.666 ns" \
#             -name {hclk60} {hclk60}
# ---------------------------------------------

#create_clock -period 16.666 -name CLK_245_M [get_ports {mclk60}]
set_input_delay -clock { mclk60 } -min 0 [get_ports {mdata[0] mdata[1] mdata[2] mdata[3] mdata[4] mdata[5] mdata[6] mdata[7] mtxen mrxfn}]
set_input_delay -clock { mclk60 } -max 12 [get_ports {mdata[0] mdata[1] mdata[2] mdata[3] mdata[4] mdata[5] mdata[6] mdata[7] mtxen mrxfn}] -add_delay
set_output_delay -clock { mclk60 } -min -1 [get_ports {mdata[0] mdata[1] mdata[2] mdata[3] mdata[4] mdata[5] mdata[6] mdata[7] mrdn mwrn moen}] 
set_output_delay -clock { mclk60 } -max 5 [get_ports {mdata[0] mdata[1] mdata[2] mdata[3] mdata[4] mdata[5] mdata[6] mdata[7] mrdn mwrn moen}] -add_delay 

#create_clock -period 16.666 -name CLK_245_H [get_ports {hclk60}]
#set_input_delay -clock { hclk60} -min 0 [get_ports   {hdata[0] hdata[1] hdata[2] hdata[3] hdata[4] hdata[5] hdata[6] hdata[7] htxen hrxfn}]
#set_input_delay -clock { hclk60} -max 12 [get_ports  {hdata[0] hdata[1] hdata[2] hdata[3] hdata[4] hdata[5] hdata[6] hdata[7] htxen hrxfn}] -add_delay
#set_output_delay -clock { hclk60} -min -1 [get_ports  {hdata[0] hdata[1] hdata[2] hdata[3] hdata[4] hdata[5] hdata[6] hdata[7] hrdn  hwrn hoen}] 
#set_output_delay -clock { hclk60} -max 5 [get_ports {hdata[0] hdata[1] hdata[2] hdata[3] hdata[4] hdata[5] hdata[6] hdata[7] hrdn  hwrn hoen}] -add_delay


# ** Clock Latency
#    -------------

# ** Clock Uncertainty
#    -----------------

# ** Multicycles
#    -----------
# ** Cuts
#    ----

# ** Input/Output Delays
#    -------------------




# ** Tpd requirements
#    ----------------

# ** Setup/Hold Relationships
#    ------------------------

# ** Tsu/Th requirements
#    -------------------


# ** Tco/MinTco requirements
#    -----------------------

#
# Entity Specific Timing Assignments found in
# the Timing Analyzer Settings report panel
#


# ---------------------------------------------
# The following clock group is added to try to 
# match the behavior of:
#   CUT_OFF_PATHS_BETWEEN_CLOCK_DOMAINS = ON
# ---------------------------------------------

#set_clock_groups -asynchronous \
#                 -group { mclk60 } \
#                 -group { hclk60 }

# ---------------------------------------------

